# Напишите функцию multiply(a,b), которая возвращает произведение чисел

def multiply(a, b):
    return a * b

print(multiply(3, 5))
print(multiply(7, 9))


